# หากมีหลาย set และอยากทำงานร่วมกัน
# *** สามารถดูภาพประกอบได้ ใน /image /set_operator

#---------------------------------------
# union เลือกทั้งหมด

fruitA={"กล้วย","มะยม","มะนาว"}
fruitB={"สตอว์เบอร์รี่","กีวี่","มะม่วง"}

allfruit=fruitA.union(fruitB)
# แต่หากต้องการแค่สมาชิกของ B ไปอยู่ใน A 
# fruitA.update(fruitB) ใช้ update 

print(allfruit)

#---------------------------------------
# copy ข้อมูล

fruit2={"กล้วย","มะยม","มะนาว"}
fruit3=fruit2.copy() # ใช้ฟังชั่น copy 
print(fruit3)

#---------------------------------------
# Difference เลือกเฉพาะตัวที่ไม่ซ้ำกันของทั้ง 2 set

fruit4={"แอปเปิ้ล","ทุเรียน","สตอว์เบอร์รี่","กีวี่","มะม่วง"}
fruit5={"กล้วย","มะยม","มะนาว","แอปเปิ้ล","ทุเรียน"}

fruit6=fruit4.difference(fruit5) 
print(fruit6)
# อยู่ที่เรากำหนดว่าจะเลือก set ไหนใก้แสดง ตัวอย่างเลือก fruit4
# ถ้าอยากให้แสดงสมาชิกของ set fruit5 ** fruit5.difference(fruit4) 


#---------------------------------------
# หากอยากได้ตัวที่เหมือนกัน 
# ตรงข้ามกับ difference คือ intersection 

fruit8={"แอปเปิ้ล","ทุเรียน","สตอว์เบอร์รี่","กีวี่","มะม่วง"}
fruit9={"กล้วย","มะยม","มะนาว","แอปเปิ้ล","ทุเรียน"}

fruit10=fruit8.intersection(fruit9) 
print(fruit10)

#---------------------------------------
# subset
fish={''}