# Dictionary

# list,tuple
from _typeshed import ReadableBuffer


lis=['สีแดง','สีเหลือง','สีเขียว']
tup=('สีแดง','สีเหลือง','สีเขียว')
print(lis[1]) # ระบุ index 

'''
อยากใช้ข้อมูลต้องจำตำแหน่ง index 
'''
# สมาชิกแตกต่างกันได้ 
# Dictionary จะมีอยู่ 2 ส่วนคือ 
# key = อ้างอิงข้อมูล (เข้าถึงข้อมูล) , value = สมาชิก (ค่าในข้อมูล) index 

# การสร้าง dict 
'''
โครงสร้าง Dictionary
ชื่อตัวแปร ={key:value,key:value,key:value}
** key:value = 1 ข้อมูล

ถ้าอยากใช้ข้อมูลให้ใช้ key เพื่ออ้างอิง

'''

colors={"red":"สีแดง","yellow":"สีเหลือง","green":"สีเขียว",700:"บ้านแสนสุข"}
print(colors["red"]) # อ้างอิง key รู้ key ได้ value


# การสร้างแบบ constructor เป็นการเปลี่ยนชนิดข้อมูล 
pets=dict(cat="แมว",dog="น้องหมา",duck="น้องเป็ด") 
print(pets["cat"])

#---------------------------------------
# การเข้าถึงข้อมูล
# สามารถระบุ 2 แบบ 
# แบบแรกระบุ key 

colors2={"red":"สีแดง","yellow":"สีเหลือง","green":"สีเขียว",700:"บ้านแสนสุข"}
print(colors2[700]) 

# แบบที่สอง 
print(colors2.get("red")) 

#---------------------------------------
# การแก้ไขข้อมูล

colors3={"red":"สีแดง","yellow":"สีเหลือง","green":"สีเขียว",700:"บ้านแสนสุข"}
colors3[700]="บ้านฉัน" # แก้ไขที่ key 700 
print(colors3)

# การเพิ่มข้อมูล  
colors3.update({"blue":"สีน้ำเงิน","orange":"สีส้ม"})
print(colors3)
# ** key เดิมถ้า update จะทำการเปลี่ยน สมาชิก key ** 
# ไม่เจอ key ซ้ำเป็นการเพิ่มเข้าไป ถ้าเจอซ้ำเป็นการแก้ไข 

#---------------------------------------
# การ loop
# ดึงข้อมูลสมาชิกมาทำงานทีละตัว 

colors4={"red":"สีแดง","yellow":"สีเหลือง","green":"สีเขียว",700:"บ้านแสนสุข"}

for item4 in colors4.keys: # แสดงผลแค่ Keys ** ให้แสดง .value 
    # หากต้องการให้แสดงทั้งคู่เลยให้ .ตามด้วยชื่อตัวแปลที่เราสร้าง เช่น .items
    print(item4)

for k,v in colors4.items():
    print("key = " ,k,"value = ",v)

#---------------------------------------
# การลบข้อมูล 
# โดยใช้ คำสั่ง pop

colors5={"red":"สีแดง","yellow":"สีเหลือง","green":"สีเขียว",700:"บ้านแสนสุข"}
print(colors5)
colors5.pop("red") # ระบุ key 
print("หลังลบข้อมูล = ",colors5)

# โดยใช้ คำสั่ง popitem 
# เป็นการลบสมาชิกตัวท้ายสุดออกไป
 
colors5.popitem()
print("ลบข้อมูลท้ายสุด = ",colors5)

# โดยใช้ คำสั่ง .clear
# ลบออกทั้งหมดเลย 

colors5.clear()
print("ลบข้อมูลออกไปหมดเลย =",colors5)

# ** หากใช้ del จะลบตัวแปร ออกไปเลย
# del colors5 

#---------------------------------------
# การคัดลอกข้อมูล
# โดยคำสั่ง copy 

colors6={"red":"สีแดง","yellow":"สีเหลือง","green":"สีเขียว",700:"บ้านแสนสุข"}
x=colors6.copy()
print(x)

#---------------------------------------
# การทำ dict ซ้อน dict