# Dictionary

# list,tuple
lis=['สีแดง','สีเหลือง','สีเขียว']
tup=('สีแดง','สีเหลือง','สีเขียว')
print(lis[1]) # ระบุ index 

'''
อยากใช้ข้อมูลต้องจำตำแหน่ง index 
'''
# สมาชิกแตกต่างกันได้ 
# Dictionary จะมีอยู่ 2 ส่วนคือ 
# key = อ้างอิงข้อมูล (เข้าถึงข้อมูล) , value = สมาชิก (ค่าในข้อมูล) index 

# การสร้าง dict 
'''
โครงสร้าง Dictionary
ชื่อตัวแปร ={key:value,key:value,key:value}
** key:value = 1 ข้อมูล

ถ้าอยากใช้ข้อมูลให้ใช้ key เพื่ออ้างอิง

'''

colors={"red":"สีแดง","yellow":"สีเหลือง","green":"สีเขียว",700:"บ้านแสนสุข"}
print(colors["red"]) # อ้างอิง key รู้ key ได้ value


# การสร้างแบบ constructor เป็นการเปลี่ยนชนิดข้อมูล 
pets=dict(cat="แมว",dog="น้องหมา",duck="น้องเป็ด") 
print(pets["cat"])

#---------------------------------------
# การเข้าถึงข้อมูล