# Return

'''
ค่าในฟังก์ชั่น เราสามารถนำค่าในนั้นมาใช้งานต่อได้โดยใช้คำสั่ง Return 
Ex. def randomNumber(x):
    if x=='100':
        print("ถูกหวย")
        return 1000 
    ....
** return ค่า 1000 ออกมา 
** สามารถนำค่านั้นออกไปใช้งานได้ต่อ

สามารถกระโดดออกจาก โปรแกรมหลักได้
ตัวอย่างด้านล่าง 
'''

def randomNumber(x):
    if len(x)<3 :
        return # ถ้าค่าหลัก X น้อยกว่า 3 จะออกจากโปรแกรมเลย 
        # หลัก = หน่วย สิบ ร้อย พัน ** 

    if x=='100':
        print("ถูกหวย")
        return 1000
    else :
        print("ไม่ถูกหวย")
        return

money=randomNumber("50")
print("เงินรางวัล = " , money)