# เจาะลึกการใช้ list

'''
หัวข้อชนิดข้อมูล 
list 
จัดการข้อมูลพื้นฐาน 
โดยนำมาเรียงกัน โดยข้อมูลข้างในนั้นเราเรียกว่าสมาชิก
ข้อมูลใน list สามารถเก็บข้อมูลต่าง type กันได้ int หรือ str ได้ 

'''
# Ex primitive 
# ตัวแปรเก็บค่าได้ 1 ค่า

# a=1 
# b=2

# ---------------------------------

# 1 การนิยาม ของ list [] **

# Ex non-primitive 
number=[1,2]  # ตัวแปรนี้มีสมาชิก 1,2 (index)

name=["นาย A","นาย B",1,2,True,3.14,-10] 
# สามารถเก็บข้อมูลได้หลายชนิด
name=list([1,2,"ระบุรูปแบบไปเลย"])
name2=["test1","test2",1,2]
print(name2)
# ---------------------------------

# 2 การเข้าถึงข้อมูล **
# **** จะทำงานในข้อมูลล่าสุด (ล่างสุด)*** 
# ดูในรูป list การเข้าถึงข้อมูล

test=["A","B","C"]
print(test[1])

# ---------------------------------

# 3 การเข้าถึงข้อมูลแบบกำหนดช่วง