# เจาะลึกการใช้ list

'''
หัวข้อชนิดข้อมูล 
list 
จัดการข้อมูลพื้นฐาน 
โดยนำมาเรียงกัน โดยข้อมูลข้างในนั้นเราเรียกว่าสมาชิก
ข้อมูลใน list สามารถเก็บข้อมูลต่าง type กันได้ int หรือ str ได้ 

'''
# Ex primitive 
# ตัวแปรเก็บค่าได้ 1 ค่า

# a=1 
# b=2

# ---------------------------------

# 1 การนิยาม ของ list [] **

# Ex non-primitive 
number=[1,2]  # ตัวแปรนี้มีสมาชิก 1,2 (index)

name=["นาย A","นาย B",1,2,True,3.14,-10] 
# สามารถเก็บข้อมูลได้หลายชนิด
name=list([1,2,"ระบุรูปแบบไปเลย"])
name2=["test1","test2",1,2]
print(name2)
# ---------------------------------

# 2 การเข้าถึงข้อมูล **
# **** จะทำงานในข้อมูลล่าสุด (ล่างสุด)*** 
# ดูในรูป list การเข้าถึงข้อมูล

test=["A","B","C"]
print(test[1])

# ---------------------------------

# 3 การเข้าถึงข้อมูลแบบกำหนดช่วง

all2=[10,"นายไข่",True,3.14,-10]
print(all2[2:]) # จะมี : มาเกี่ยวด้วย กำหนดเริ่ม : สุดท้าย 

# ---------------------------------

# การแก้ไขข้อมูล
# list สามารถแก้ไขข้อมูลได้

number10=[1,2,3,4]
# ชื่อตัวแปร [index] = " ข้อมูลที่ต้องการแก้ไข "

print("ก่อนแก้ไข : " ,number10)
number10[2]=9 # แก้ไข index ที่ 2 ให้เป็นเลข 9
number10[-1]="แก่ไข" 
print("หลังแก้ไข :" ,number10)

# ---------------------------------

# แสดงผลด้วย loop
number11=[1,2,3,4,5,6,7,8,9]
# ถ้ารู้รอบที่ชัดเจนใช้ for 

sum=0
for x in number11:
    sum+=x # sum=sum+x
print(sum)

# ---------------------------------

# ตรวจสอบข้อมูล 
# เช็คข้อมูลว่า ในกลุ่มข้อมูลนี้มีข้อมูล นี้หรือเปล่า

fruit=["มะม่วง","มะนาว",",มะยม"]
if "มะม่วง" in fruit:
    print("มี")
else:
    print("ไม่มี")

# ---------------------------------

# นับจำนวนสมาชิก ( len )
number12=[1,2,3,4,5,6,7,8,9,10,11,12,13,14,25,89,54,101,250,1146,587,-1]
print(len(number12))

# ---------------------------------

#len() ทำงานร่วมกับ loop for
fruit2=["มะม่วง","มะนาว",",มะยม","มะละกอ"]

for i in range(len(fruit2)):
    print(fruit2(i)) # แสดงสมาชิกด้วย

for item in fruit2:
    print(item) # ได้เหมือนกัน

# ---------------------------------

# การเพิ่มข้อมูลโดยใช้ => append , insert
fruit3=["มะม่วง","มะนาว",",มะยม","มะละกอ"]
print("ก่อนเพิ่ม :",fruit3)

# append() นำสมาชิกใหม่ มาต่อท้ายข้อมูลเดิม
fruit3.append("มะปราง")
print("หลังเพิ่ม :",fruit3)

# insert(index,สมาชิกใหม่) นำสมาชิกใหม่ แทรกในข้อมูลเดิม 
fruit3.insert(1,"ทุเรียน")
print("หลังแทรกข้อมูล",fruit3)

# ---------------------------------

# การลบข้อมูล => remove , pop , del , clear
